{
  "question_id" : 44806131,
  "title" : "Emulating inheritance with C preprocessor",
  "body" : "<p>I've been thinking about this and my guess is that many people would currently describe me as follows: </p>\n\n<p><em>\"Good enough to make use of the C preprocessor, not good enough to not make use of the C preprocessor\"</em></p>\n\n<p>All jokes aside, I had an idea on how to implement interfaces in C. The idea is really simple, but when searching for questions discussing this, I did not see it mentioned. </p>\n\n<p>So, the \"standard\" inheritence emulation method in C is essentially</p>\n\n<pre><code>struct dad {\n   arm_t right_arm;\n   arm_t left_arm;\n}\n\nstruct kid {\n   struct dad parent;\n   diaper_t diaper;\n}\n</code></pre>\n\n<p>Which I think is ugly, <code>because kid.parent.right_arm</code> just makes less sense than <code>kid.right_arm</code>. There is another way apparently, if you don't mind using gcc-exclusive flags, which is something like</p>\n\n<pre><code>struct kid {\n    struct dad;\n    diaper_t diaper;\n}\n</code></pre>\n\n<p>but this is not portable. What is portable, however, is</p>\n\n<pre><code>// file: dad.interface\narm_t right_arm;\narm_t left_arm;\n\n// file: kid.h\nstruct kid {\n    #include dad.interface\n    diaper_t diaper;\n}\n</code></pre>\n\n<p>I'm pretty sure this will go down like this: I will get a billion downvotes from dogmatists commenting \"don't do this\", as well as a couple of answers offering alternative ways of emulating inheritence that avoids preprocessor directives. I will comment that I wasn't looking for opaque criticism on my coding style but rather wanted a clear explanation as to WHY we should not do this.</p>\n\n<p>So if you all don't mind, let's just SKIP the first phase of the process and get straight to the part about WHY this would be a bad idea. Feel free to downvote, but please mention WHY you feel the question is a bad one.</p>\n\n<p>PS: My first guess would be that this implementation would be somewhat similar to the original C++ implementation which as I understand it was basically \"C compiler + some preprocessor hacks\", but this is just speculation. If anyone knows if my hunch is correct, feel free to chime in.</p>\n",
  "link" : "https://stackoverflow.com/questions/44806131/emulating-inheritance-with-c-preprocessor",
  "owner" : {
    "user_id" : 7893856,
    "user_type" : "registered",
    "display_name" : "user7893856",
    "profile_image" : "https://www.gravatar.com/avatar/198fd92b6eddb8baae2a9c5bf140bfdb?s=128&d=identicon&r=PG&f=1",
    "link" : "https://stackoverflow.com/users/7893856/user7893856",
    "reputation" : 30,
    "accept_rate" : 100
  },
  "is_answered" : false,
  "creation_date" : 1498661947,
  "last_activity_date" : 1498661947,
  "tags" : [
    "c",
    "inheritance",
    "c-preprocessor"
  ],
  "score" : 0,
  "view_count" : 4,
  "answer_count" : 0
}