{
  "question_id" : 44805949,
  "title" : "Janus graph + Cassandra (Generic questions)",
  "body" : "<p>I have a few questions regarding the integration of the two tools. Not technical questions and how to setup( i will have my fun with that later ) but more on the course of the project and the direction, seeing that janus is still very young.</p>\n\n<p>I am starting a new project and already decided to use cassandra for storage and using a graph on top sounds very appealing to me.</p>\n\n<p>A couple of things that i would like to know in advance before i take that road.</p>\n\n<ol>\n<li><p>Janus is very young and it picks up from where Titan left about a year or so ago. There is gap there but the fact that is part of the Linux Foundation and all the big players are going to support it sounds promising. Is it safe to assume at this point that Janus is here to stay? Would it be safe to depend on Janus as a startup project? And follow development ofcourse and be up to date as much as possible.</p></li>\n<li><p>Cassandra. Titan/Janus integrates with cassandra 2.1.9 using the thrift api which will be deprecated eventually in cassandra 4. I know that work is being done at the moment to make janus work with cassandra 3 and eventually work with cql as well. Is it safe to start with existing janus and cassandra 2.1.9 and deal with the migration later on? Will it be a huge task for a startup to handle?</p></li>\n<li><p>Production ready Janus.(This question relates to any kind of software in it's early stages and whether it's safe for a start up to use). As i understand it, it will take some time for Janus to be production ready and catch up with the rest of the tools it integrates with( although work is being done as we speak:)). Again would it be safe to start using Janus at this point and follow development and finally migrate to a production ready version? What is the overall roadmap for Janus?</p></li>\n</ol>\n\n<p>My concern in general is whether the combination of the tools is a safe choice for a start up. The whole stack is already new to us and we are excited to try and learn but we will hit a migration period pretty quickly. Is it something that you would do/recommend? Is it a suicide?</p>\n\n<p>Please share your thoughts and keep in mind that it doesn't have to be about the stack i am talking about. It could be any startup company dealing with any kind of software in it's early stages.</p>\n\n<p>Cheers</p>\n",
  "link" : "https://stackoverflow.com/questions/44805949/janus-graph-cassandra-generic-questions",
  "owner" : {
    "user_id" : 3696272,
    "user_type" : "registered",
    "display_name" : "centos",
    "profile_image" : "https://i.stack.imgur.com/seZvf.jpg?s=128&g=1",
    "link" : "https://stackoverflow.com/users/3696272/centos",
    "reputation" : 23,
    "accept_rate" : null
  },
  "is_answered" : false,
  "creation_date" : 1498661539,
  "last_activity_date" : 1498661539,
  "tags" : [
    "cassandra",
    "graph-databases",
    "titan",
    "cassandra-2.1",
    "janusgraph"
  ],
  "score" : 0,
  "view_count" : 6,
  "answer_count" : 0
}