{
  "question_id" : 44826528,
  "title" : "AXI Bridge trouble export from HPS QSYS Altera Cyclone V",
  "body" : "<p>I need to export AXI bridge master interface from QSYS. So I connect H2F_axi_master signal from HPS component in QSYS with slave signal of AXI bridge component (from IP catalog). Then I double click for exporting master signal of AXI bridge. I do Base Address assignments and other stuff like clock connections to have no errors and then generate code. Seems legit but not. I debug my baremetal program. When I try to access H2F address space (0xc0000000) in memory window of DS-5, or write/read from this location it shows message \"! Cannot stop target\" and everything is broken. I tried to connect memory and PIO in QSYS to H2F bridge HPS, in that case I easily can access H2F memory space, no errors when writing/reading. But in my project I have to export AXI bridge outside of QSYS. I checked that no matter what you connect to AXI Bridge if you left it master unconnected or export outside QSYS you cannot use it (cannot access address space of bridge), otherwise it works properly.  So it's completly impossible to do something to avoid or fix this error. I tried to use alt_addr_space_remap and alt_bridge_init functions from hwlib to set up bridges but nothing helps. What is the problem? I don't believe that this cannot be solved, maybe I don't know some tricks to use H2F and other bridges of HPS. Please help.</p>\n",
  "link" : "https://stackoverflow.com/questions/44826528/axi-bridge-trouble-export-from-hps-qsys-altera-cyclone-v",
  "owner" : {
    "user_id" : 7158473,
    "user_type" : "registered",
    "display_name" : "Vlad Timofeev",
    "profile_image" : "https://www.gravatar.com/avatar/593de54d98c56146893a3e5c42fee7b1?s=128&d=identicon&r=PG&f=1",
    "link" : "https://stackoverflow.com/users/7158473/vlad-timofeev",
    "reputation" : 4,
    "accept_rate" : null
  },
  "is_answered" : false,
  "creation_date" : 1498742958,
  "last_activity_date" : 1498742958,
  "tags" : [
    "altera",
    "qsys",
    "cyclone"
  ],
  "score" : -1,
  "view_count" : 4,
  "answer_count" : 0
}