{
  "question_id" : 44826263,
  "title" : "Laravel and Laragon from Windows to Linux",
  "body" : "<p>Ok so I've been using Laragon 2.2.2 on Windows, and Laravel (the latest version I believe), and for now the whole thing was sitting in <code>C:\\laragon\\www\\site</code>.<br/>\nNow I need to move the site to a local host, on a Linux virtual machine (the virtual machine doesn't matter that much, just remember a 'Linux' system), and I'll probably use xampp, I've been told it's a good alternative to Laragon. I wanted to know if you got any suggestion on how I could process this system changing, without \"breaking\" anything.<br/><br/>\nBy breaking, I mean that all the path I use in Controllers, for example, wouldn't work if I just change the root folder (I used sometimes the Laravel helper <code>storage_path()</code> or <code>public_path()</code>, and I don't really know if this is even a good way to use Laravel. Also when using the Storage, or all facades in general, I'm not sure if everything wuold still work.<br/><br/>\nI need to know how many things i need to modify to make the web site work after moving everything to a Linux system. I think about a file in config that contains a path that <code>storage_path()</code> would be loading, so we can easey edit this file and use all paths this way.... I'm not very experienced with Laravel, expecially when it's about paths.<br/><br/>\nNote: The web site does not contains any database related content, only files withing Laravel file system (in Storage, or public), views, templates, Laravel basic stuff.</p>\n",
  "link" : "https://stackoverflow.com/questions/44826263/laravel-and-laragon-from-windows-to-linux",
  "owner" : {
    "user_id" : 7065188,
    "user_type" : "registered",
    "display_name" : "Pierre Lartigau",
    "profile_image" : "https://www.gravatar.com/avatar/8fd0611d15101d92ef82abd27197e4a7?s=128&d=identicon&r=PG&f=1",
    "link" : "https://stackoverflow.com/users/7065188/pierre-lartigau",
    "reputation" : 12,
    "accept_rate" : 38
  },
  "is_answered" : false,
  "creation_date" : 1498742286,
  "last_activity_date" : 1498742286,
  "tags" : [
    "linux",
    "laravel",
    "laragon"
  ],
  "score" : 0,
  "view_count" : 6,
  "answer_count" : 0
}