{
  "uuid" : "345ec2d98355015c8f5f6b7113705fc254b93919",
  "bioAsHtml" : "<p>Mikaël Barbero is a passionate software engineer. He started programming at the age of 10 with BASIC and hasn&#x27;t stopped since. After having led and contributed to many Eclipse project (especially in the modeling area), he is now a senior Eclipse platform developer and is also taking care of the release engineering for the Eclipse Foundation. A hacker at heart, Mikael likes to untangle everyday things to reveal their design layers. It lets him understand how things are built and what makes them beautiful. To him, good design is not only attractive, but also targeted for a purpose.</p>\n",
  "acceptedTalks" : [
    {
      "talkType" : "Conference",
      "track" : "Java, JVM, Javas SE/EE",
      "links" : [
        {
          "href" : "http://cfp.devoxx.fr/api/conferences/DevoxxFR2017/talks/DJP-0430",
          "rel" : "http://cfp.devoxx.fr/api/profile/talk",
          "title" : "More details about this talk"
        },
        {
          "href" : "http://cfp.devoxx.fr/api/conferences/DevoxxFR2017/speakers/345ec2d98355015c8f5f6b7113705fc254b93919",
          "rel" : "http://cfp.devoxx.fr/api/profile/speaker",
          "title" : "Mikaël Barbero"
        }
      ],
      "id" : "DJP-0430",
      "title" : "Great new features and enhancements in the Eclipse IDE"
    }
  ],
  "company" : "Eclipse Foundation",
  "bio" : "Mikaël Barbero is a passionate software engineer. He started programming at the age of 10 with BASIC and hasn't stopped since. After having led and contributed to many Eclipse project (especially in the modeling area), he is now a senior Eclipse platform developer and is also taking care of the release engineering for the Eclipse Foundation. A hacker at heart, Mikael likes to untangle everyday things to reveal their design layers. It lets him understand how things are built and what makes them beautiful. To him, good design is not only attractive, but also targeted for a purpose.\r\n",
  "lastName" : "Barbero",
  "firstName" : "Mikaël",
  "blog" : "https://mikael-barbero.tumblr.com",
  "avatarURL" : "http://www.gravatar.com/avatar/4eedae8c73cf3d82ad7bda23626fbb94",
  "twitter" : "@mikbarbero",
  "lang" : "fr"
}